# US School Analysis

## Start with imports and reading in your data

In [1]:
# Include all your imports here
import pandas as pd
from pathlib import Path
import numpy as np

In [2]:
# Load the Public school dataset
data_path = 'Resources/public_school_data.csv'
data = pd.read_csv(data_path)
data.head()

,NCESSCH,LSTATE,SCHOOL_LEVEL,SCHOOL_TYPE_TEXT,TOTAL,FTE,STUTERATIO,AM,AS,BL,HP,HI,TR,WH
0,10000500870,AL,Middle,Regular school,908.0,42.0,21.62,2.0,4.0,33.0,0.0,469.0,29.0,371.0
1,10000500871,AL,High,Regular school,1606.0,82.0,19.59,1.0,6.0,70.0,0.0,785.0,38.0,706.0
2,10000500879,AL,Middle,Regular school,891.0,41.0,21.73,4.0,7.0,24.0,1.0,481.0,29.0,345.0
3,10000500889,AL,Elementary,Regular school,908.0,49.0,18.53,4.0,4.0,48.0,0.0,497.0,15.0,340.0
4,10000501616,AL,Elementary,Regular school,556.0,30.0,18.53,4.0,2.0,33.0,0.0,288.0,13.0,216.0

In [3]:
# Load the Public school locations dataset
locations_path = 'Resources/public_school_locations.csv'
locations = pd.read_csv(locations_path)
locations.head()

            ID   LATCOD     LONCOD
0  10000500870  34.2602 -86.206200
1  10000500871  34.2622 -86.204900
2  10000500879  34.2733 -86.220100
3  10000500889  34.2527 -86.221806
4  10000501616  34.2898 -86.193300

In [4]:
# Load the Public school data dictionary file
dicts_path = 'Resources/school_data_dictionary.csv'
dictionary = pd.read_csv(dicts_path)
dictionary.head()

     Fields                   Field Descriptions
0  OBJECTID                             OBJECTID
1     Shape                                Shape
2   NCESSCH                     Unique School ID
3  SURVYEAR  Year corresponding to survey record
4     STABR       Postal state abbreviation code

## Data Exploration and Preparation

In [5]:
# Use an .isin() function on dictionary to keep only fields that appear in the main public_school_data.csv and identify the unique id column 
dict2 = dictionary['Fields'].isin(data.columns)
dict2

0     False
1     False
2      True
3     False
4     False
      ...
73    False
74    False
75     True
76    False
77    False
Name: Fields, Length: 78, dtype: bool

In [6]:
dictionary = dictionary[dict2]
dictionary

              Fields                                 Field Descriptions
2            NCESSCH                                   Unique School ID
12            LSTATE                                     Location state
21      SCHOOL_LEVEL                                       School level
25  SCHOOL_TYPE_TEXT                          School type (description)
51             TOTAL            Total students all grades (includes AE)
53               FTE                                     Total Teachers
54        STUTERATIO                              Student teacher ratio
57                AM       All Students - American Indian/Alaska Native
60                AS                               All Students - Asian
63                BL           All Students - Black or African American
66                HP  All Students - Native Hawai'ian or Other Pacif...
69                HI                            All Students - Hispanic
72                TR                   All Students - Two or More Races
75                WH                               All Students - White

In [7]:
# Ensure the column you selected is indeed a unique identifier by checking the number of uniqe values and comparing it to the number of rows in the dataframe
data['NCESSCH'].unique

<bound method Series.unique of 0          10000500870
1          10000500871
2          10000500879
3          10000500889
4          10000501616
              ...
100717    780003000024
100718    780003000026
100719    780003000027
100720    780003000033
100721    780003000034
Name: NCESSCH, Length: 100722, dtype: int64>

In [8]:
# Change the names of the unique ID column in both the location data and public school data to match and set them as index
data = data.rename(columns = {'NCESSCH':'SCHOOL_ID'})
dictionary.at[2, 'Fields'] = 'SCHOOL_ID'
data = data.set_index(['SCHOOL_ID'])
dictionary = dictionary.set_index(['Fields'])

In [9]:
# Check your work
data.head()

,LSTATE,SCHOOL_LEVEL,SCHOOL_TYPE_TEXT,TOTAL,FTE,STUTERATIO,AM,AS,BL,HP,HI,TR,WH
SCHOOL_ID,,,,,,,,,,,,,
10000500870,AL,Middle,Regular school,908.0,42.0,21.62,2.0,4.0,33.0,0.0,469.0,29.0,371.0
10000500871,AL,High,Regular school,1606.0,82.0,19.59,1.0,6.0,70.0,0.0,785.0,38.0,706.0
10000500879,AL,Middle,Regular school,891.0,41.0,21.73,4.0,7.0,24.0,1.0,481.0,29.0,345.0
10000500889,AL,Elementary,Regular school,908.0,49.0,18.53,4.0,4.0,48.0,0.0,497.0,15.0,340.0
10000501616,AL,Elementary,Regular school,556.0,30.0,18.53,4.0,2.0,33.0,0.0,288.0,13.0,216.0

In [10]:
# Check your work
dictionary.head()

                                       Field Descriptions
Fields
SCHOOL_ID                                Unique School ID
LSTATE                                     Location state
SCHOOL_LEVEL                                 School level
SCHOOL_TYPE_TEXT                School type (description)
TOTAL             Total students all grades (includes AE)

In [11]:
locations = locations.rename(columns={'ID' : 'SCHOOL_ID'})
locations = locations.set_index(['SCHOOL_ID'])

In [20]:
# Join the location and data dataframes together
locdata = pd.concat([locations, data], axis=1)
# Using merge:
# locdata = pd.merge(locations, data, on='SCHOOL_ID', how='left')
locdata.head()

,LATCOD,LONCOD,LSTATE,SCHOOL_LEVEL,SCHOOL_TYPE_TEXT,TOTAL,FTE,STUTERATIO,AM,AS,BL,HP,HI,TR,WH
SCHOOL_ID,,,,,,,,,,,,,,,
10000500870,34.2602,-86.206200,AL,Middle,Regular school,908.0,42.0,21.62,2.0,4.0,33.0,0.0,469.0,29.0,371.0
10000500871,34.2622,-86.204900,AL,High,Regular school,1606.0,82.0,19.59,1.0,6.0,70.0,0.0,785.0,38.0,706.0
10000500879,34.2733,-86.220100,AL,Middle,Regular school,891.0,41.0,21.73,4.0,7.0,24.0,1.0,481.0,29.0,345.0
10000500889,34.2527,-86.221806,AL,Elementary,Regular school,908.0,49.0,18.53,4.0,4.0,48.0,0.0,497.0,15.0,340.0
10000501616,34.2898,-86.193300,AL,Elementary,Regular school,556.0,30.0,18.53,4.0,2.0,33.0,0.0,288.0,13.0,216.0

In [21]:
# Get the value counts for the school type column
locdata['SCHOOL_TYPE_TEXT'].value_counts()

Regular school                  91595
Alternative Education School     5588
Special education school         1946
Career and Technical School      1593
Name: SCHOOL_TYPE_TEXT, dtype: int64

In [22]:
# Create a subset of the dataframe that only includes regular schools. Ensure it was successful by comparing rows in the subset to the value counts above
regular_schools = locdata[locdata['SCHOOL_TYPE_TEXT'] == 'Regular school']
regular_schools.count()

LATCOD              91595
LONCOD              91595
LSTATE              91595
SCHOOL_LEVEL        91595
SCHOOL_TYPE_TEXT    91595
TOTAL               90727
FTE                 84942
STUTERATIO          91063
AM                  69437
AS                  79701
BL                  84536
HP                  59190
HI                  89338
TR                  86623
WH                  89227
dtype: int64

## Data Cleaning and dealing with nulls

In [ ]:
# Check for nulls and determine the best approach for dealing with them

In [ ]:
# Fill some of the columns with 0 where it makes sense

In [ ]:
# Verify changes to nulls and prepare to drop na

In [ ]:
# Drop remaining nulls wher it would make sense

In [ ]:
# Verify changes to nulls and no nulls should remain

## Plotting to help Clean the Data

In [ ]:
# Plot a histogram of Total enrolled students and check for outliers

In [ ]:
# Plot a histogram of Total Teachers and check for outliers

In [ ]:
# Plot a histogram of Student Teacher Ratio and check for outliers

In [ ]:
# Re-Plot a histogram of Total enrolled students after removing 0s and outliers above the 99th quantile

In [ ]:
# Re-Plot a histogram of Total Teachers after removing 0s and outliers above the 99th quantile

In [ ]:
# Re-Plot a histogram of Student Teacher Ratio after removing 0s and outliers above the 99th quantile

## Correlation Plot to Understand Data Relationships

In [ ]:
# Use seaborn to generate a correlation heatmap for the columns in the dataframe

## Geographic Plots

In [ ]:
# Plot only schools from the 48 contiguous US states or the 50 US states (drop territories and PR)

In [ ]:
# Plot only schools in your state

## School Quality Analysis: Student/Teacher Ratios

In [ ]:
# Use the dataframe that has filtered out the outliers in Student Teacher Ratio and group by state and get the average
# Show the highest 5 Student/Teacher ratios and lowest 5 Student/Teacher ratios as well as the average for your state

In [ ]:
# What is the mean of the Student/Teacher Ratio

In [ ]:
# What is the standard deviation of the Student/Teacher Ratio

In [ ]:
# Plot the states ratios in descending order

In [ ]:
# Plot a boxplot of the Student/Teacher Ratios

In [ ]:
# List or Plot the Highest 5 states

In [ ]:
# List or plot the lowest 5

In [ ]:
# Print your state's Student Teacher Ratios

## Summarize your findings from any of the analysis or plots above:
* Were there any interesting Correlations?
* How did your state compare to others?
* Would you have made any different decisions in the earlier cleaning stages after becoming more familiar with the data?
* What is going on in IL?
* What other analysis could be done with this data?

## BONUS: Generate other interesting analysis or plots

In [ ]:
# Your code below